app/Http/Controllers/Api/Web/UserController.php

    public function profile(Request $request, $id)
    {
        $user = User::where('id', $id)
            ->whereIn('role_name', [Role::$organization, Role::$teacher, Role::$user])
            ->first();
---
select * from `users` where `id` = '1048' and `role_name` in ('organization', 'teacher', 'user') limit 1